<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
<HEAD>
<TITLE>Playlist Creator 3.6.2</TITLE>
<link rel="stylesheet" type="text/css" href="../res/help.css">
</HEAD>

<BODY BGCOLOR="#FFFFFF" LEFTMARGIN="0" TOPMARGIN="0" MARGINWIDTH="0" MARGINHEIGHT="0">
<a name="top"></a>

<table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td width="5%"></td>
    
    <td width="90%">
      <table width="100%" border="0" cellspacing="0" cellpadding="0">
        <tr>
          <td>
            <h1>Bedienung des Programms</h1>
          </td>
        </tr>

        <tr>
          <td height="25">&nbsp;</td>
        </tr>

        <tr>
          <td>
            <ol>
              <li><a href="#chapter1">Erstellung einer Playlist</a></li>
              <li><a href="#chapter2">Eintr&auml;ge zu einer Playlist hinzuf&uuml;gen</a></li>
              <li><a href="#chapter3">Existierende Playlist-Dateien öffnen oder einfügen</a></li>
              <li><a href="#chapter4">Ordner rekursiv zu einer Playlist hinzuf&uuml;gen</a></li>
              <li><a href="#chapter5">Reihenfolge der Playlisteintr&auml;ge &auml;ndern</a></li>
              <li><a href="#chapter6">Eintr&auml;ge von der Playlist entfernen</a></li>
              <li><a href="#chapter7">Dynamische Titel erzeugen</a></li>
              <li><a href="#chapter8">Eigene Dateitypen hinzuf&uuml;gen</a></li>
              <li><a href="#chapter9">Wo finde ich die gr&uuml;nen H&uuml;te?</a></li>
            </ol>
          </td>
        </tr>

        <tr>
          <td height="35">&nbsp;</td>
        </tr>

        <tr>
          <td>
            <ol style="margin-left: 25px;">
              <li>
                <a name="chapter1"></a><strong>Erstellung einer Playlist</strong><br><br>
                F&uuml;gen Sie der Playlist zuerst alle gew&uuml;nschten Lieder hinzu. W&auml;hlen Sie anschlie&szlig;end
                den Speicherort der Playlist aus. Nun muss nur noch der Name der Playlist eingegeben und der gew&uuml;nschte
                Playlisttyp ausgew&auml;hlt werden. Durch Klick auf "Playlist erstellen" kann die Playlist nun erstellt
                werden.<br><br><br>
              </li>
              
              <li>
                <a name="chapter2"></a><strong>Eintr&auml;ge zu einer Playlist hinzuf&uuml;gen</strong><br><br>
                Es gibt verschiedene Möglichkeiten Einträge zu einer Playlist hinzuzufügen: Klicken Sie auf die Schaltfl&auml;che
                "Ordner hinzuf&uuml;gen", um den Inhalt eines gesamten Ordners hinzuzuf&uuml;gen oder auf die Schaltfl&auml;che
                "Dateien hinzuf&uuml;gen", um ein oder mehrere Dateien zur Playlist hinzuzuf&uuml;gen. Möchten Sie den Inhalt einer
                bereits existierenden Playlist hinzufügen, klicken Sie auf die Schaltfläche "Playlist hinzufügen" und wählen Sie
                die gewünschte Playlist aus.<br><br>

                Ordner, Dateien und Playlists können auch per Drag&Drop vom Windows Explorer hinzugef&uuml;gt werden. Bitte
                beachten Sie, dass Playlists nur einzeln hinzugefügt werden können (Single Selection)!<br><br>

                Die ausgew&auml;hlten Dateien werden der Playlist nur dann hinzugef&uuml;gt, wenn sich der betreffende Dateityp in
                der Liste der aktiven Dateitypen befindet (Einstellungen >> Dateitypen). Ein kleines Beispiel: Der Ordner
                den Sie hinzuf&uuml;gen möchten enthalte MP3- und OGG-Dateien. In der Liste der aktiven Dateitypen sei der
                Dateityp 'MP3' enthalten, der Typ 'OGG' jedoch nicht. F&uuml;gen Sie der Playlist diesen Ordner hinzu, so
                werden alle MP3-Dateien in die Playlist aufgenommen, alle OGG-Dateien werden nicht aufgenommen.<br><br><br>
              </li>

              <li>
                <a name="chapter3"></a><strong>Existierende Playlist-Dateien öffnen oder einfügen</strong><br><br>
                Es gibt zwei Methoden, um den Inhalt einer existierenden Playlist zu importieren: Die Playlist öffnen oder
                einfügen.<br><br>

                Eine Playlist öffnen bedeutet, dass die momentane Playlist verworfen und der Inhalt der zu öffnenden
                Playlist eingefügt wird. Außerdem wird der Speicherort, der Name und der Typ der Playlist automatisch
                mit der zu öffnenden Playlist initialisiert. Diese Methode bietet sich also an, wenn eine existierende Playlist
                editiert werden soll.<br><br>

                Es gibt zwei Varianten, um eine Playlist zu öffnen: Klicken Sie entweder in der Toolbar auf die Schaltfläche
                "Öffnen" und wählen Sie die gewünschte Playlist aus, oder werfen Sie eine einzelne Playlist per Drag&Drop vom
                Windows Explorer auf die Playlist und klicken Sie anschließend auf die Schaltfläche "Öffnen".<br><br>

                Eine Playlist einfügen bedeutet, dass der Inhalt der Playlist an der ausgewählten Stelle der momentanen
                Playlist eingefügt wird. Die momentane Playlist wird also nicht verworfen, sondern um den Inhalt der
                eingefügten Playlist ergänzt. Auch der Speicherort, der Name und der Typ der momentanen Playlist werden nicht
                verändert.<br><br>

                Auch beim Einfügen von Playlisten gibt es zwei Varianten: Klicken Sie entweder auf die Schaltfläche
                "Playlist hinzufügen" und wählen Sie die gewünschte Playlist aus, oder werfen Sie eine einzelne Playlist per
                Drag&Drop vom Windows Explorer auf die Playlist und klicken Sie anschließend auf die Schaltfläche "Einfügen".<br><br><br>
              </li>

              <li>
                <a name="chapter4"></a><strong>Ordner rekursiv zu einer Playlist hinzuf&uuml;gen</strong><br><br>
                Ordner können sowohl mittels Drag&Drop vom Windows Explorer, als auch mittels der Schaltfl&auml;che "Ordner hinzuf&uuml;gen" rekursiv
                (d.h. Inhalt des Ordners und aller Unterordner) zur Playlist hinzugef&uuml;gt werden.<br><br>

                Um Ordner mittels Drag&Drop rekursiv hinzuzuf&uuml;gen, lassen Sie den entsprechenden Ordner mit gedr&uuml;ckter "Strg"-Taste auf die
                Playlist fallen. Nat&uuml;rlich können auch mehrere Ordner und/oder Dateien gleichzeitig auf die Playlist fallengelassen und rekursiv
                hinzugef&uuml;gt werden.<br><br>

                Möchten Sie einen Order mittels der Schaltfl&auml;che "Ordner hinzuf&uuml;gen" rekursiv zur Playlist hinzuf&uuml;gen, so m&uuml;ssen Sie lediglich
                im Ordner-Auswahldialog die Checkbox "Ordner rekursiv hinzuf&uuml;gen", welche sich direkt unter der Anzeige des momentan ausgew&auml;hlten
                Ordners befindet, ausw&auml;hlen und mit 'Ok' best&auml;tigen.<br><br><br>
              </li>

              <li>
                <a name="chapter5"></a><strong>Reihenfolge der Playlisteintr&auml;ge &auml;ndern</strong><br><br>
                W&auml;hlen Sie die Eintr&auml;ge aus, die Sie verschieben m&ouml;chten und klicken Sie auf die Schaltfl&auml;che "Nach oben verschieben"
                bzw. "Nach unten verschieben". Die Eintr&auml;ge der Playlist k&ouml;nnen zudem auch per Tastenk&uuml;rzel verschoben werden:
                Mittels der Tastenkombination "Strg + Pfeil oben" werden die ausgew&auml;hlten Eintr&auml;ge nach oben bzw. mit "Strg + Pfeil unten" nach unten
                verschoben. Dieselbe Funktionalit&auml;t bietet auch das Kontextmen&uuml; der Playlist. Ein Rechtsklick auf den markierten Eintr&auml;gen l&auml;ßt das
                Kontextmen&uuml; erscheinen und man kann die gew&uuml;nschte Aktion ausw&auml;hlen.<br><br>

                Außerdem ist es möglich, die markierten Eintr&auml;ge an den Anfang bzw. an das Ende der Liste zu verschieben. Dies funktioniert
                analog wie im obigen Abschnitt beschrieben per entsprechender Schaltfläche, Tastenkombination oder Kontextmenüeintrag.<br><br>

                Die Auswahl mehrerer Eintr&auml;ge erfolgt genau wie im Windows Explorer: Einfach die entsprechenden Eintr&auml;ge mit gedr&uuml;ckter "Shift"- bzw.
                "Strg"-Taste anklicken.<br><br><br>
              </li>

              <li>
                <a name="chapter6"></a><strong>Eintr&auml;ge von der Playlist entfernen</strong><br><br>
                Klicken Sie entweder auf die Schaltfl&auml;che "Markierte Eintr&auml;ge entfernen" um die momentan ausgew&auml;hlten Eintr&auml;ge von der
                Playlist zu entfernen, oder auf die Schaltfl&auml;che "Alle Eintr&auml;ge entfernen" um alle Eintr&auml;ge der Playlist zu
                entfernen. Die markierten Eintr&auml;ge k&ouml;nnen zudem auch mit dem Tastenk&uuml;rzel "Strg + Entf" entfernt werden. Um alle Einträge zu
                entfernen verwenden Sie das Tastenk&uuml;rzel "Strg + Shift + Entf". Eine weitere Möglichkeit, Eintr&auml;ge von der Playlist zu entfernen,
                bietet das Kontextmen&uuml; der Playlist. Ein Rechtsklick in der Playlist bzw. auf den markierten Eintr&auml;gen l&auml;ßt das
                Kontextmen&uuml; erscheinen und man kann die gew&uuml;nschte Aktion ausw&auml;hlen.<br><br>

                Bei all diesen Operationen werden lediglich die betreffenden Eintr&auml;ge aus der Playlist entfernt. Die zugeh&ouml;rigen
                Dateien auf der Festplatte werden selbstverst&auml;ndlich nicht gel&ouml;scht!<br><br>

                Die Auswahl mehrerer Eintr&auml;ge erfolgt genau wie im Windows Explorer: Einfach die entsprechenden Eintr&auml;ge mit gedr&uuml;ckter "Shift"- bzw.
                "Strg"-Taste anklicken.<br><br><br>
              </li>

              <li>
                <a name="chapter7"></a><strong>Dynamische Titel erzeugen</strong><br><br>
                Um die Erzeugung dynamischer Titel zu aktivieren klicken Sie in den Einstellungen auf den Unterpunkt "Erweiterte Informationen". Aktivieren
                Sie dort die Optionen "Erweiterte Informationen schreiben" und "Daten von Tags auslesen". Direkt darunter kann nun das gew&uuml;nschte Titelformat
                eingegeben werden. Die zur Verf&uuml;gung stehenden Titelvariablen werden auf der rechten Seite des Dialogs aufgelistet.<br><br>

                Hinweis: Dynamische Titel können nur bei Dateitypen erzeugt werden, welche die Einbettung von Tags (Metadaten) unterstützen. Dazu gehören
                beispielsweise die Dateitypen MP3, OGG und WMA.<br><br><br>
              </li>

              <li>
                <a name="chapter8"></a><strong>Eigene Dateitypen hinzuf&uuml;gen</strong><br><br>
                Klicken Sie in den Einstellungen auf den Unterpunkt "Dateitypen". Geben Sie dort auf der rechten Seite den neuen
                Dateityp ein und klicken Sie auf die Schaltfl&auml;che "Neu". Der von Ihnen eingegebene Dateityp wird nun der Liste
                der inaktiven Dateitypen hinzugef&uuml;gt. Wollen Sie diesen Dateityp sofort aktivieren, so w&auml;hlen Sie den Typ aus
                und klicken Sie auf die Schaltfl&auml;che "Hinzuf&uuml;gen".<br><br><br>
              </li>

              <li>
                <a name="chapter9"></a><strong>Wo finde ich die gr&uuml;nen H&uuml;te?</strong><br><br>
                Direkt neben den goldenen Fallschirmen!
              </li>
            </ol>
          </td>
        </tr>

        <tr>
          <td height="15">&nbsp;</td>
        </tr>
      </table>
    </td>
    <td width="5%"></td>
  </tr>
</table>

</BODY>
</HTML>